app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.microposts.build(micropost_params)
    @micropost.image.attach(params[:micropost][:image])
    if @micropost.save
---
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "This is a new micro-post."], ["user_id", 1], ["created_at", "2023-09-12 07:29:46.319945"], ["updated_at", "2023-09-12 07:29:46.319945"]]

    def correct_user
        @micropost = current_user.microposts.find_by(id: params[:id])
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]