app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email: params[:session]{:email}.to_s.downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "{\"email\"=>\"example@railstutorial.org\", \"password\"=>\"123456\", \"remember_me\"=>\"1\"}"], ["LIMIT", 1]]